JaKaczocha/ToFDataInterp/ToF_3DCam_L5/board/pin_mux.h
/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TIRQ_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TIRQ_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TIRQ_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TIRQ_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TIRQ_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_8 (number 24), P17[19]/PIO1_8_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TRST_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TRST_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TRST_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TRST_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TRST_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_11 (number 93), P17[6]/PIO1_11_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TLPn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TLPn_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TLPn_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TLPn_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TLPn_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_ToFCamPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
